<?php
class WX_Face
{

	public static $face_puth = '<img src="http://cache.soso.com/img/img/e%s.gif">';

	public static $init = false;

	public static $face_keys = array ();

	public static $face_values = array ();

	public static $wx_face = array (
			'/::)' => 100, //微笑
			'/::~' => 101, //撇嘴 
			'/::B' => 102, //色
			'/::|' => 103, //发呆
			'/:8-)' => 104, //得意
			'/::<' => 105, //流泪
			'/::$' => 106, //害羞
			'/::X' => 107, //闭嘴
			'/::Z' => 108, //睡
			'/::\'(' => 109, //大哭
			'/::-|' => 110, //尴尬
			'/::@' => 111, //发怒
			'/::P' => 112, //调皮
			'/::D' => 113, //呲牙
			'/::O' => 114, //惊讶
			' /::(' => 115, //难过
			'/::+' => 116, //酷
			'/:--b' => 117, //冷汗
			'/::Q' => 118, //抓狂
			'/::T' => 119, //吐
			'/:,@P' => 120, //偷笑
			'/:,@-D' => 121, //愉快
			'/::d' => 122, //白眼
			'/:,@o' => 123, //傲慢
			'/::g' => 124, //饥饿
			'/:|-)' => 125, //困
			'/::!' => 126, //惊恐
			'/::L' => 127, //流汗
			'/::>' => 128, //憨笑
			'/::,@' => 129, //悠闲
			'/:,@f' => 130, //奋斗
			'/::-S' => 131, //咒骂
			'/:?' => 132, //疑问
			'/:,@x' => 133, //嘘
			'/:,@@' => 134, //晕
			'/::8' => 135, //疯了
			'/:,@!' => 136, //衰
			'/:!!!' => 137, //骷髅
			'/:xx' => 138, //敲打
			'/:bye' => 139, //再见
			'/:wipe' => 140, //擦汗
			'/:dig' => 141, //抠鼻
			'/:handclap' => 142, //鼓掌
			'/:&-(' => 143, //糗大了
			'/:B-)' => 144, //坏笑
			'/:<@' => 145, //左哼哼
			

			'/:@>' => 146, //右哼哼
			'/::-O' => 147, //哈欠
			'/:>-|' => 148, //鄙视
			'/:P-(' => 149, //委屈
			'/::\'|' => 150, //快哭了
			'/:X-)' => 151, //阴险
			'/::*' => 152, //亲亲
			'/:@x' => 153, //吓
			'/:8*' => 154, //可怜
			'/:pd' => 155, //菜刀
			'/:<W>' => 156, //西瓜
			'/:beer' => 157, //啤酒
			'/:basketb' => 158, //篮球
			'/:oo' => 159, //乒乓
			'/:coffee' => 160, //咖啡
			'/:eat' => 161, //饭
			'/:pig' => 162, //猪头
			'/:rose' => 163, //玫瑰
			'/:fade' => 164, //凋谢
			'/:fade' => 164, //凋谢
			'/:showlove' => 165, //嘴唇
			'/:heart' => 166, //爱心
			'/:break' => 167, //心碎
			'/:cake' => 168, //蛋糕
			

			'/:li' => 169, //闪电
			'/:bome' => 170, //炸弹
			'/:kn' => 171, //刀
			'/:footb' => 172, //足球
			'/:ladybug' => 173, //瓢虫
			'/:shit' => 174, //便便
			'/:moon' => 175, //月亮
			'/:sun' => 176, //太阳
			'/:gift' => 177, //礼物
			'/:hug' => 178, //拥抱
			'/:strong' => 179, //强
			'/:weak' => 180, //弱
			'/:share' => 181, //握手
			'/:v' => 182, //胜利
			'/:@)' => 183, //抱拳
			'/:jj' => 184, //勾引
			'/:@@' => 185, //拳头
			'/:bad' => 186, //差劲
			'/:lvu' => 187, //爱你
			'/:no' => 188, //NO
			'/:ok' => 189, //OK
			'/:love' => 190, //爱情
			'/:<L>' => 191, //飞吻
			

			'/:jump' => 192, //跳跳
			'/:shake' => 193, //发抖
			'/:<O>' => 194, //怄火
			'/:circle' => 195, //转圈
			'/:kotow' => 196, //磕头
			'/:turn' => 197, //回头
			'/:skip' => 198, //跳绳
			'/:oY' => 199, //投降
			'/:#-0' => 200, //激动
			'/:hiphot' => 201, //乱舞
			'/:kiss' => 202, //献吻
			'/:<&' => 203, //左太极
			'/:&>' => 204  //右太极
	);

	public static function parseFace($str)
	{
		if (! $str || ! is_string($str))
			return $str;
		if (self::$init == false)
			self::init();
		return str_replace(self::$face_keys, self::$face_values, $str);
	}

	public static function init()
	{
		self::$init = true;
		foreach (self::$wx_face as $k => $v) {
			self::$wx_face[$k] = sprintf(self::$face_puth, $v);
		}
		self::$face_keys = array_keys(self::$wx_face);
		self::$face_values = array_values(self::$wx_face);
	}
}

